#+TITLE: Docker Images
#+AUTHOR: Martín Alsinet
#+DATE: 2017
#+OPTIONS: toc:nil ':t num:nil
#+LANGUAGE: es
#+PROPERTY: header-args:sh :exports code :padline no :results output drawer :mkdirp yes
#+PROPERTY: header-args:dockerfile :exports code :padline no :mkdirp yes

**** Montar /Users/martin como volumen

Geiser carga algunos archivos desde la carpeta =~/.emacs.d/elpa/geiser-xxx/scheme/= para inicializar el REPL. Obviamente esta carpeta no se encuentra disponible adentro del contenedor, y por lo tanto, cuando lanzaba =M-x run-geiser= me daba un error porque no encontraba los archivos .scm.

Para corregir ese error hice que el comando monte la carpeta =/Users= como un volumen dentro del contenedor.

#+BEGIN_SRC sh :results output drawer
ls -al ~/.emacs.d/elpa/geiser-*/scheme
#+END_SRC

#+RESULTS:
:results:
total 0
drwxr-xr-x   8 martin  staff   256 Jan 14 16:20 .
drwxr-xr-x  71 martin  staff  2272 Jan 14 16:20 ..
drwxr-xr-x   3 martin  staff    96 Jan 14 16:20 chez
drwxr-xr-x   3 martin  staff    96 Jan 14 16:20 chibi
drwxr-xr-x   3 martin  staff    96 Jan 14 16:20 chicken
drwxr-xr-x   3 martin  staff    96 Jan 14 16:20 guile
drwxr-xr-x   3 martin  staff    96 Jan 14 16:20 mit
drwxr-xr-x   3 martin  staff    96 Jan 14 16:20 racket
:end:

